#summary Взять на руки пушку в 3

Вертикальная пушка после того как сбита с угла может быть подхвачена на руки, если успеть спрыгнуть с веревки и ударить ее рукой, чтобы не улетела.

После подхвата она слетает с рук через небольшое время. Но ее можно пинать сколько угодно, продвигаясь по уровню. Например последняя пушка в 3-2 может быть схвачена и перенесена через большую яму за счет прыждков из бездны, и далее ударами с веревки ее можно донести до Ропера.

В ходе несения пушка создает графические глюки, так как несение вписывает объекту значения в те, атрибуты, которые для него могут быть вовсе не предусмотрены, или отвечать за другое.

В зависимости от кадра, когда пушка выпала сама или была выброшена руками, она может просто упасть либо прицепиться и стрелять. Если правильно донести ее до босса, она прицепится и будет стрелять 2 видами пуль - быстрыми и медленными. Можно проманипулировать ей, чтобы она подстрелила прыгающего в шаттл персонажа. Это не нанесет ему урона, но отменит запрыгивание в шаттл.

http://www.youtube.com/watch?v=9EEbQld_nSs