#summary Бег по сетке в 2-3

Если после смерти лифтера в БТДД в уровне 2-2 [Dash забежать на сетку] и с нее сбежать в выход, в уровне 2-3 режим "бег по сетке" смешается с обычным и будут возможны новые глюки.

При нажатии Вверх персонаж станет ползти по воздуху как по сетке и вылезет снизу. Горизонтальные движения ускорены. Чтобы пробраться вниз к байку надо нажимать много раз Винз и Прыжок.

Если в таком режиме залезть на байк и разбить капсулу, персонаж исчезнет. Вернуть его можно зажав Вперед.

Анимация удара ломается.

Но если получить урон, глюк исчезает.

http://www.youtube.com/watch?v=NJQjIMq46C0