#summary Работа Влево+Вправо

В 3-мерных уровнях нажимая Влепо+Вправо можно подниматься вверх по оси Y (вглубь экрана). Но в этих уровнях позволен такой подьем, так что взаимодействие с объектами и уровнями не нарушается.

В 2-мерных уровнях движение Вверх запрещено, но Влепо+Вправо запускает его. Персонаж начинает подниматься над полом и некоторые враги идут вслед за ним. Другие остаются на месте и больше не взаимодействуют с героем, хотя иногда могут задевать его.

Если в уровнях со скроллингом Вверх персонаж подинмется на такую высоту, что пол выгрузится из РАМ, он упадет вниз немного ниже уровня пола.

=Жабы=

==4 уровень==

Если нажать Влепо+Вправо на склоне вида /, то жаба поедет вниз по оси глубины. Так она может провалиться сквозь пол. Нажатие Влепо+Вправо на склоне вида \ ведет к подъему жабы над полом. Если нажать Влепо+Вправо и отпустить, жаба будет еще скользить по оси глубины.

=БТДД=

==5 уровень==

В этом уровне пол имеет узкие коллизионные границы, поэтому можно свалиться с него, сместившись по оси глуины. При этом способность прыгать и бегать остается, а значит можно перемещаться гипер-прыжками.

В реальном времени так играть невозможно, потому что враги тоже начинают сваливаться с платформ и улетают в бездну, но это не убивает их.